{
  "collections": [
    {
      "id": "2",
      "name": "React Concepts",
      "cardsCount": 6
    },
    {
      "id": "3",
      "name": "Business English Phrases",
      "cardsCount": 4
    },
    {
      "id": "4",
      "name": "General Knowledge",
      "cardsCount": 5
    },
    {
      "name": "Testeee",
      "id": "UKiCPYR"
    },
    {
      "name": "New",
      "id": "kuy-GWO"
    },
    {
      "name": "test",
      "id": "Uz0wKr2"
    },
    {
      "name": "adios",
      "id": "HVoQrQp"
    },
    {
      "name": "what",
      "id": "sxOCKeS"
    },
    {
      "name": "bien",
      "id": "8OeiMdG"
    },
    {
      "name": "mal",
      "id": "1Ox-C2r"
    },
    {
      "name": "otro",
      "id": "RaiK9gE"
    }
  ],
  "cards": [
    {
      "id": "3",
      "collectionId": "2",
      "front": "pues not se que pasa cn mi patata ",
      "back": "React.memo() is a higher-order component that can be used to wrap components that are expensive to render. It prevents unnecessary re-renders by performing a shallow comparison of props. Use it when you have a component that re-renders frequently with the same props and doesn't depend on parent component state or context."
    },
    {
      "id": "4",
      "collectionId": "2",
      "front": "Explain the difference between useState and useRefhjknvv",
      "back": "useState triggers a re-render when the state changes and is used for values that should cause UI updates. useRef persists values between renders without causing re-renders and is ideal for storing mutable values that shouldn't trigger re-renders, like DOM elements or previous values."
    },
    {
      "id": "5",
      "collectionId": "3",
      "front": "How to politely disagree in a business meeting?",
      "back": "I see your point, however...\nI understand where you're coming from, but...\nThat's an interesting perspective. Have you considered...?\nWhile I agree with some aspects, I think..."
    },
    {
      "id": "6",
      "collectionId": "4",
      "front": "What causes the Aurora Borealis (Northern Lights)?",
      "back": "The Aurora Borealis is caused by collisions between electrically charged particles from the sun that enter the Earth's atmosphere. These particles are directed by Earth's magnetic field towards the poles, where they collide with gases like oxygen and nitrogen, creating stunning displays of light in various colors, typically green and pink."
    },
    {
      "id": "8",
      "collectionId": "4",
      "front": "What is the deepest point on Earth?",
      "back": "The Challenger Deep in the Mariana Trench is the deepest known point on Earth, reaching approximately 11,034 meters (36,201 feet) below sea level."
    },
    {
      "id": "9",
      "collectionId": "4",
      "front": "Who wrote 'Romeo and Juliet'?",
      "back": "William Shakespeare wrote 'Romeo and Juliet' between 1591-1595. It's one of his most famous tragic plays about two young star-crossed lovers."
    },
    {
      "id": "10",
      "collectionId": "4",
      "front": "What is photosynthesis?",
      "back": "Photosynthesis is the process by which plants convert light energy into chemical energy. Plants use sunlight, water, and carbon dioxide to produce glucose and oxygen."
    }
  ]
}